//
//  Top100.swift
//  Algo-Swift
//
//  Created by Seven on 2020/3/7.
//  Copyright © 2020 KM. All rights reserved.
//

import Foundation
/**
 字节跳动Top
* 1) 两数之和
* 2) 两数相加
* 3) 无重复字符的最长子串
* 4) 最长回文子串
* 5) 接雨水
* 6) 反转链表
* 7) 寻找两个有序数组的中位数
* 8) 盛最多水的容器
* 9) 两数之和
* 10) 合并两个有序链表
*/

/**
 * 11) 最大子序和
 * 12) LRU缓存机制
 * 13) K 个一组翻转链表
 * 14) 买卖股票的最佳时机
 * 15) 分发糖果
 * 16) 搜索旋转排序数组
 * 17) 有效的括号
 * 18) 合并K个排序链表
 * 19) 合并区间
 * 20) 整数反转
 **/

/**
 * 21) 字典序的第K小数字
 * 22) 回文数
 * 23) 数组中的第K个最大元素
 * 24) 全排列
 * 25) 删除链表的倒数第N个节点
 * 26) 下一个排列
 * 27) 编辑距离
 * 28) 岛屿数量
 * 29) 复原IP地址
 * 30) 爬楼梯
 **/

/**
 * 31) 正则表达式匹配
 * 32) 相交链表
 * 33) 二叉树的中序遍历
 * 34) 二叉树的层次遍历
 * 35) 二叉树的锯齿形层次遍历
 * 36)     对称二叉树
 * 37) 二叉树的右视图
 * 38) 零钱兑换
 * 39) 螺旋矩阵
 * 40) 字符串转换整数 (atoi)
 **/

/**
 * 41) 括号生成
 * 42)     合并两个有序数组
 * 43)     重排链表
 * 44)     最长公共前缀
 * 45) 二叉树的最大深度
 * 46) 第二高的薪水
 * 47) 最长有效括号
 * 48) 两两交换链表中的节点
 * 49) 单词搜索
 * 50) 买卖股票的最佳时机 II
 **/
