//
//  字符串 Top10.swift
//  Algo-Swift
//
//  Created by 李昆明 on 2021/10/3.
//  Copyright © 2021 KM. All rights reserved.
//

import Foundation
/*
 * 1) 无重复字符的最长子串
 
 * 2) 有效的括号
 
 * 3) 字符串相加
 
 * 4) 最长回文子串
 
 * 5) 字符串转换整数 (atoi)

 * 6)  翻转字符串里的单词

 * 7)  最小覆盖子串

 * 8) 编辑距离

 * 9) 复原IP地址
 
 * 10) 括号生成

 * 11) 字符串相乘

 * 12) 最长有效括号

 * 13) 比较版本号

 * 14)  验证IP地址
 
 * 15) 最长公共前缀

 * 16) 基本计算器 II

 * 17) 验证回文串
 
 * 18) 反转字符串
 
 * 19)正则表达式匹配
 
 * 20) 有效的括号字符串
 */


// 题解 第1次
// * 1) 无重复字符的最长子串
// 给定一个字符串 s ，请你找出其中不含有重复字符的 最长子串 的长度。



// * 2) 有效的括号
 
// * 3) 字符串相加
//
// * 4) 最长回文子串
//
// * 5) 字符串转换整数 (atoi)
